Revit 2027 API
DesignToFabricationConverter.GetConvertedFabricationPartsWithInvalidConnections Method
 Gets the collection of converted fabrication parts with invalid connections.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ElementId, ElementId> GetConvertedFabricationPartsWithInvalidConnections()
Public Function GetConvertedFabricationPartsWithInvalidConnections As IDictionary(Of ElementId, ElementId)
public:
IDictionary<ElementId^, ElementId^>^ GetConvertedFabricationPartsWithInvalidConnections()
member GetConvertedFabricationPartsWithInvalidConnections : unit -> IDictionary<ElementId, ElementId>
Return Value
IDictionary<ElementId, ElementId>
Remarks
 This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace